app/controllers/contacts_controller.rb

SELECT * FROM "contacts" ORDER BY contacts.id DESC LIMIT 1
---
  def index
    @contacts = current_user.contacts.all

SELECT * FROM "contacts" WHERE ("contacts"."id" = 5 AND ("contacts".user_id = 1))
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 5 AND ("contacts".user_id = 1))
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "company", "address", "created_at", "updated_at", "user_id", "phone", "email") VALUES('Saqib', 'conceivian', 's', '2010-01-16 00:52:33', '2010-01-16 00:52:33', NULL, '4252502424', 'saqibr@conceivian.com')
---
  def create
    @contact = Contact.new(params[:contact])
    @contact.user=current_user
    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
UPDATE "contacts" SET "updated_at" = '2009-12-22 08:18:18', "address" = 'This is his address' WHERE "id" = 1
---
  def update
    @contact = Contact.find(params[:id])
    return permission_denied unless @contact.user == current_user
    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 2)
DELETE FROM "contacts" WHERE "id" = 2
---
  def destroy
    @contact = Contact.find(params[:id])
    return permission_denied unless @contact.user == current_user
    @contact.destroy