app/controllers/deals_controller.rb

  def index
    @deals = current_user.deals.all
---
SELECT * FROM "deals" WHERE ("deals".user_id = 2)

  def show
    @deal = Deal.find(params[:id])
---
SELECT * FROM "deals" WHERE ("deals"."id" = 1)

  def create
    @deal = Deal.new(params[:deal])
    @deal.user=current_user
    respond_to do |format|
      if @deal.save
---
INSERT INTO "deals" ("company", "created_at", "title", "updated_at", "description", "status") VALUES('microsoft', '2010-01-14 20:25:12', 'A new deal', '2010-01-14 20:25:12', 'Could go anyway', 'Planning')

  def destroy
    @deal = Deal.find(params[:id])
    return permission_denied unless @deal.user == current_user
    @deal.destroy
---
SELECT * FROM "deals" WHERE ("deals"."id" = 1)
DELETE FROM "deals" WHERE "id" = 1