app/controllers/messages_controller.rb

SELECT * FROM "messages" WHERE ("messages".user_id = 2)
---
  def index
    @messages = current_user.messages.all

INSERT INTO "messages" ("created_at", "from", "updated_at", "user_id", "message") VALUES('2010-01-18 02:18:27', 'fa', '2010-01-18 02:18:27', 2, 'fads')
---
  def create
    @message = Message.new(params[:message])
    @message.user=current_user
    respond_to do |format|
      if @message.save