app/controllers/password_resets_controller.rb

  def create
    @user=User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'prolificcoder@gmail.com') LIMIT 1

  def update
    @user.password= params[:user][:password]
    @user.password_confirmation= params[:user][:password_confirmation]
    if @user.save
---
UPDATE "users" SET "persistence_token" = '31bce281c5f2f10bf77b11000a451204ec85f9e279c2786d13005b94a857f199c8785e60f70cda1ca6f43b2530e7a51882320a3c181f6c16addaafbcae91a713', "updated_at" = '2010-01-15 22:22:43', "perishable_token" = 'teJful6imJz8PJ3YetAy', "password_salt" = 'A7DiqH0lZSru66zC8_bD', "crypted_password" = 'a40f5f6ae098c4079a0128e2e86a9b2ee79b0e5509d4683c46cae455e3ace375a59b403702613588223cfb1041d4de67042303655507d964dc2db5a00c95ff04' WHERE "id" = 1

  def load_user_using_perishable_token
    @user=User.find_using_perishable_token(params[:id])
---
SELECT * FROM "users" WHERE (perishable_token = 'nTWXNM7xKpNTq6vslu4o' and updated_at > '2010-01-15 22:12:43') LIMIT 1