app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.all
---
SELECT * FROM "tasks" WHERE ("tasks".user_id = 2)

  def create
    @task = Task.new(params[:task])
    @task.user = current_user
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "title", "updated_at", "user_id", "description", "due", "status") VALUES('2010-01-17 21:29:48', 'Test the site', '2010-01-17 21:29:48', NULL, 'Do it nicely', '2010-01-17', 'pending')

  def update
    @task = Task.find(params[:id])
    return permission_denied unless @task.user == current_user
    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "status" = 'pending', "due" = '2010-01-22', "updated_at" = '2010-01-20 02:22:42' WHERE "id" = 1

  def deliver
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)