app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "perishable_token", "lastname", "password_salt", "firstname", "persistence_token", "email") VALUES('2010-01-16 00:27:50', '1c54da984030aed9c2f60c4091e777612100bf167675b9ab3055675397045520892610a7ebc5d2518563c3b0d61fc798b90643405a769c9d38c5f9f78a206b11', '2010-01-16 00:27:50', 'Bmo-uK4-NYjLvZTTAEfk', 'chinni', 'cZ2Hh9v3nF8CfJCis-Bo', 'Shruti', '7e3e241dedfb3c1c666669d461ee7ed2f03d93d5cf6b943620abc89838dda30e534eaa15ce0e6d5a41211c61b4ed415861fbcf518e4c3c7b4721f7747e9e03a1', 'chinni.shruti@gmail.com')
---
  def create
    @user= User.new (params[:user])
    if @user.save